#include "timer.h"

/*******************************************************************
*					preset最大值为65535 
*
*   	11.0592Mhz    1s 计数 921600 次 =>  1ms -> 921.6次 
*	    12.0000Mhz    1s 计数 1000000次 =>  1ms -> 1000 次
*  						
*********************************************************************/

void timer0_init(int preset)
{
	//设置定时器0模式
	TMOD &=~(0XF<<0);	//清零
	TMOD |=	(0X1<<0);	//TMOD为方式1
	TL0 =(65535-preset)%256;
	TH0 =(65535-preset)/256;

	TF0 = 0;		//清除TF0标志
	EA=1;
	ET0=1;
	TR0 =1;			//定时器0启动
}

void timer1_init(int preset)
{
	//设置定时器1模式
	TMOD &=~(0XF<<4);	//清零
	TMOD |=	(0X1<<4);	//TMOD为方式1
	TL1 =(65535-preset)%256;
	TH1 =(65535-preset)/256;
	
	TF1 = 0;		//清除TF0标志
	EA=1;
	ET1=1;
	TR1 =1;			//定时器1启动
}

